---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.ViewActivatingEventArgs
source: html/8100cf14-8af3-2660-aafc-a903627b34e7.htm
---
# ViewActivatingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.